{
  "beginner": {
    "Simple_Times": "Present Simple (Простое настоящее время): Образование: Глагол в инфинитиве (без to) для 3-го лица единственного числа (he, she, it) добавляется окончание -s/-es (например, works, goes, watches). Для остальных лиц глагол остается в инфинитиве. Вспомогательные глаголы: Отсутствуют. Функции: Регулярные действия, привычки, факты, расписания. Пример: I go to school every day. She works in a bank. Past Simple (Простое прошедшее время): Образование: Для правильных глаголов добавляется окончание -ed (например, worked, played, wanted). Для неправильных глаголов используется вторая форма глагола из таблицы неправильных глаголов (например, went, saw, ate). Вспомогательные глаголы: Отсутствуют. Функции: Завершенные действия в прошлом, привычки в прошлом. Пример: I went to the cinema yesterday. He played football last Sunday. Future Simple (Простое будущее время): Образование: Вспомогательный глагол will + инфинитив основного глагола (например, will go, will see, will work). Можно также использовать shall (в основном, с I и we, но используется реже). Для выражения спонтанных решений используется will. Вспомогательные глаголы: will или shall. Функции: Действия, которые произойдут в будущем. Пример: I will go to the party tomorrow. We shall see what happens.",
    "Comparison_Of_Adjectives": "Сравнение прилагательных: Односложные прилагательные обычно образуют сравнительную степень с помощью суффикса -er (например, tall-taller), а превосходную степень — с помощью суффикса -est (например, tall-tallest). Прилагательные, оканчивающиеся на -e, добавляют -r и -st (например, nice-nicer-nicest). Прилагательные, оканчивающиеся на согласную-гласную-согласную, удваивают последнюю согласную и добавляют -er/-est (например, big-bigger-biggest). Двусложные прилагательные, оканчивающиеся на -y, меняют -y на -i и добавляют -er/-est (например, happy-happier-happiest). Большинство других прилагательных образуют сравнительную степень с помощью слова more (например, beautiful-more beautiful), а превосходную — с помощью слова most (например, beautiful-most beautiful). Неправильные прилагательные имеют уникальные формы (например, good-better-best, bad-worse-worst).",
    "Interrogative_Sentences": "Interrogative Sentences (вопросительные предложения) образуются с помощью инверсии (обратного порядка слов) — вспомогательный глагол ставится перед подлежащим; вопросительные слова (what, where, when, why, who, whom, whose, which, how) ставятся в начало предложения; для общих вопросов используется вспомогательный глагол (do/does/did/will/would/can/could/may/might/should/must) перед подлежащим; для специальных вопросов используется вопросительное слово + вспомогательный глагол (если требуется) + подлежащее + смысловой глагол; в вопросах к подлежащему порядок слов не меняется."
  },
  "intermediate": {
    "Continuous_Times": "Continuous Tenses (Непрерывные времена) описывают действия, которые происходят в определенный момент времени или продолжаются некоторое время. Образование всех Continuous времен происходит с помощью глагола to be в соответствующем времени + ing-форма основного глагола (глагол + ing). Present Continuous (am/is/are + ing), Past Continuous (was/were + ing), Future Continuous (will be + ing). Функции: действие, происходящее в момент речи (Present Continuous); действие, происходившее в определенный момент в прошлом (Past Continuous); действие, которое будет происходить в определенный момент в будущем (Future Continuous). Важно: Continuous времена не используются с глаголами состояния (например, to be, to know, to love, to want).",
    "Subjunctive_Mood": "Subjunctive Mood (Сослагательное наклонение) в английском языке используется для выражения желаний, предположений, просьб, требований и других нереальных или гипотетических ситуаций; образуется с помощью базовой формы глагола (без to) после глаголов, выражающих просьбу, желание, требование (например, suggest, demand, insist, recommend, request, require, ask, propose, order), в that-clause после некоторых прилагательных (например, essential, important, necessary, vital, crucial, desirable, advisable) и в условных предложениях типа 2 и 3; в современном английском языке часто заменяется by-формами.",
    "Passive_Voice": "Passive Voice (Пассивный залог) образуется с помощью вспомогательного глагола to be в соответствующем времени и причастия II смыслового глагола: Present Simple: am/is/are + V3; Past Simple: was/were + V3; Future Simple: will be + V3; Present Perfect: have/has been + V3; Past Perfect: had been + V3; Future Perfect: will have been + V3; Present Continuous: am/is/are being + V3; Past Continuous: was/were being + V3; Future Continuous: will be being + V3."
  },
  "advanced": {
    "Perfect_Times": "Perfect Tenses (Perfect – совершенные времена) выражают завершенность действия по отношению к другому моменту времени. Образование: вспомогательный глагол have (или has для 3-го лица единственного числа) + причастие прошедшего времени (Past Participle) основного глагола. Present Perfect (настоящее совершенное) выражает действие, завершившееся до момента речи, с возможной связью с настоящим; Past Perfect (прошедшее совершенное) – действие, завершившееся до другого действия в прошлом; Future Perfect (будущее совершенное) – действие, которое будет завершено к определенному моменту в будущем.",
    "MultiLevel_Sentences": "Multilevel Sentences (многоуровневые предложения) — это предложения, содержащие несколько придаточных предложений, вложенных друг в друга, создавая сложную структуру. Правила их построения включают правильное использование запятых, союзов (например, because, although, while, if, when, since, after, before, unless, until, as if, as though, so that, in order that), союзных слов (who, whom, whose, which, that, where, when), соблюдение порядка слов в каждом придаточном предложении и правильное согласование времён. Сложность заключается в понимании смысловых отношений между частями предложения и в избежание двусмысленности."
  }
}